InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовЗаМесяц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчетаССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчетаССайта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HTTPServices/Cabinet/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль HTTP-сервісу "Cabinet" для особистого кабінету абонента водоканалу.
//
// ПРИЗНАЧЕННЯ: віддає бекенду кабінету дані з 1С у форматі JSON та приймає
// показання лічильників. Це ВЛАСНИЙ об'єкт (не пов'язаний із gkh.in.ua).
// Логіку запитів узято за перевіреним зразком (CommonModule.GkhInUaHbt),
// але сервіс самодостатній і не залежить від нього.
//
// ПУБЛІКАЦІЯ: додати як HTTP-сервіс (краще — Розширенням конфігурації),
//   RootURL = "cabinet", шаблон URL = "/{entity}",
//   методи: GET -> getData, POST -> postData.
//   Опублікувати на веб-сервері; доступ — лише через HTTPS та з IP кабінету.
//
// ЕНДПОІНТИ (GET, параметр ?CODE=<GUID лицевого счёта>, без CODE — усі):
//   /accounts /contacts /balances /finances /payments /meters /indications
// ЗАПИС (POST /readings, тіло — JSON-масив показань).
//
// УВАГА: код призначено для рев'ю та компіляції вашим спеціалістом 1С
//        (перевірити у вашій версії конфігурації перед публікацією).
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеФункции

// Версія модуля. Віддається в /state — за нею видно, ЯКА саме версія сервісу
// зараз опублікована в 1С (файл у репозиторії сам по собі нічого не змінює).
// Оновлювати при кожній зміні логіки.
Функция ВерсияСервиса()
	// Маркери нижче перевіряються документами ВИПРАВЛЕННЯ-САЛЬДО.md,
	// НАРАХУВАННЯ-ЗА-СЕРЕДНІМ.md і ЛІЧИЛЬНИКИ-ФІЛЬТР.md — вони шукають їх
	// у /state підрядком. Не прибирайте їх при наступних правках, лише додавайте.
	Возврат "2026-08-13.1"
		+ " balances=ОстаткиИОбороты+СГРУППИРОВАТЬ;"
		+ " indications=+INDICATION_AVERAGE;"
		+ " meters=Действует у ГДЕ (вода+тепло);"
		+ " accounts=+ACCESS_PASSWORD; finances=+SERVICE_NAME;"
		+ " fix=Функция,-Активность,accounts-guard,json-dates";
КонецФункции

Функция ЛицевойСчетПоGUID(УИД)
	Возврат Справочники.ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
КонецФункции

Функция ПриборУчетаПоGUID(УИД)
	Возврат Справочники.ПриборыУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
КонецФункции

// ТаблицаЗначений -> JSON-рядок (масив об'єктів). Неопределено -> null.
//
// Дати віддаються рядком "yyyy-MM-dd" — ОДНИМ форматом для всіх ендпоінтів.
// Раніше getRawBalance форматував їх вручну в окремі колонки, а getPayments,
// getMeters і getIndications віддавали сирий тип Дата, тож бекенд кабінету
// отримував з різних ендпоінтів різні формати. Перетворення зібране тут,
// в одному місці — інакше кожен новий ендпоінт довелося б пам'ятати окремо.
// Порожня дата (01.01.0001) -> null, а не "0001-01-01".
Функция ТаблицаВJSON(Таблица)
	Массив = Новый Массив;
	Для каждого Стр Из Таблица Цикл
		Объект = Новый Структура;
		Для каждого Кол Из Таблица.Колонки Цикл
			Значение = Стр[Кол.Имя];
			Если Значение = Неопределено Тогда
				Значение = Null;
			ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
				Значение = ?(ЗначениеЗаполнено(Значение), Формат(Значение, "ДФ=yyyy-MM-dd"), Null);
			КонецЕсли;
			Объект.Вставить(Кол.Имя, Значение);
		КонецЦикла;
		Массив.Добавить(Объект);
	КонецЦикла;
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Массив);
	Возврат Запись.Закрыть();
КонецФункции

Функция JSONОтвет(Таблица)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТаблицаВJSON(Таблица), КодировкаТекста.UTF8);
	Возврат Ответ;
КонецФункции

Функция УстановитьКодЛС(Таблица)
	Для каждого Строка Из Таблица Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Таблица.Колонки.Удалить("ЛицевойСчет");
КонецФункции

#КонецОбласти

#Область Читання

// CODE не задано -> перелік усіх ЛС (без паролів доступу).
// CODE задано   -> дані одного ЛС, разом із ACCESS_PASSWORD (реквізит
//                  ЛицевыеСчета.ПарольДоступа) для реєстрації абонента.
Функция getAccounts(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	ЛС.ЛицевойСчет.Представление КАК ACCOUNT_NUMB,
	|	ЛС.ЛицевойСчет.ПарольДоступа КАК ACCESS_PASSWORD,
	|	ЛС.ЛицевойСчет.КодКОАТУУ КАК LOCALITY_CODE,
	|	ЕСТЬNULL(Отв.ОтветственныйВладелец.ФизЛицо.Представление, НЕОПРЕДЕЛЕНО) КАК DELEGATE_LAST,
	|	ЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ЛС.ЛицевойСчет.Владелец.Представление КАК Адрес,
	|	ЛС.ЛицевойСчет.ОбъектЛицевогоСчета.Представление КАК Квартира
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ИСТИНА" + Условие + ") КАК Отв
	|		ПО Отв.ЛицевойСчет = ЛС.ЛицевойСчет";
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("STREET_NAME");
	Результат.Колонки.Добавить("BUILDING_NUMB");
	Результат.Колонки.Добавить("ADDRESS_NUMB");
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		// Звертання по індексу захищені перевіркою кількості. Без неї одна
		// будівля, у представленні якої менше двох ком, валить ВЕСЬ запит
		// ("Индекс находится за границами массива"), а accounts — точка входу
		// кабінету: вона має лишатися робочою навіть на кривих адресах.
		Адрес = УправлениеКонтактнойИнформацией.РазложитьСтрокуНаПодстроки(Строка.Адрес, ",");
		Строка.STREET_NAME   = ?(Адрес.Количество() > 0, СокрЛП(Адрес[0]), "");
		Строка.BUILDING_NUMB = ?(Адрес.Количество() > 1, СокрЛП(Сред(Адрес[1], 7)), "");
		КвНомер = СокрЛП(Сред(Строка.Квартира, 6));
		Строка.ADDRESS_NUMB  = ?(КвНомер = "0" ИЛИ КвНомер = "", НЕОПРЕДЕЛЕНО, КвНомер);
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("Адрес");
	Результат.Колонки.Удалить("Квартира");
	// Пароль доступу віддаємо ЛИШЕ для конкретного ЛС (запит із CODE),
	// щоб не вивантажувати паролі всіх абонентів одним запитом.
	Если НЕ ЗначениеЗаполнено(CODE) Тогда
		Результат.Колонки.Удалить("ACCESS_PASSWORD");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция getContacts(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = " И ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	""phone"" КАК CONTACT_TYPE,
	|	ЛС.ЛицевойСчет.МобТелефон КАК CONTACT_DATA,
	|	ЛС.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛС
	|ГДЕ
	|	ЛС.ЛицевойСчет.МобТелефон <> """" И ЛС.ЛицевойСчет.МобТелефон <> ""0""
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО, ""phone"", ЛС.ЛицевойСчет.Телефон, ЛС.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, Действует" + Условие + ") КАК ЛС
	|ГДЕ
	|	ЛС.ЛицевойСчет.Телефон <> """" И ЛС.ЛицевойСчет.Телефон <> ""0""";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.CONTACT_DATA = СокрЛП(Строка.CONTACT_DATA);
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции

// Баланс по місяцях. Джерело — ЗАЛИШОК самого регістру РасчетыПоЛицевымСчетам
// (віртуальна таблиця ОстаткиИОбороты), тобто рівно те, на чому побудований
// типовий звіт Отчет.ВедомостьПоРасчетамЛицевыхСчетов («Відомість за
// розрахунками особових рахунків»). Завдяки цьому кабінет збігається з
// «Відомістю» за побудовою, а не відтворює її формулу.
//   СуммаПриход  -> «Нараховано» (CALC_ACCRUAL),
//   СуммаРасход  -> «Сплачено»  (CALC_PAYMENT),
//   СуммаКонечныйОстаток -> кінцеве сальдо (CALC_FINISH), борг ДОДАТНІЙ.
//
// ВАЖЛИВО — СГРУППИРОВАТЬ. Регістр має виміри Организация, ЛицевойСчет, Услуга,
// МесяцНачисления, тож віртуальна таблиця віддає ОКРЕМИЙ рядок на кожну
// комбінацію вимірів у місяці. Без підсумовування кабінет брав лише перший
// такий рядок — і суми, що лежать на інших комбінаціях (зокрема переплата з
// документа «Введення початкових залишків», у якого своя Услуга/МесяцНачисления),
// просто випадали з розрахунку. Тому підсумовуємо всі виміри в межах місяця.
//
// РАНІШЕ (до цього) баланс ще й реконструювався вручну по типах документів із
// фіксованими знаками (+нарахування −оплата), що ігнорувало фактичний
// ВидДвижения на коригуваннях/сторно/поверненнях і виключало «Закриття місяця».
//
// УВАГА (перевірити при публікації): якщо у вашій базі борг виходить зі
// зворотним знаком (борг/переплата міняються місцями) — домножте
// CALC_START/CALC_ACCRUAL/CALC_PAYMENT/CALC_FINISH на -1 (коментар нижче).
// Пеня входить у Приход, субсидія — у Расход (як у «Відомості»); окрема розбивка
// по послугах лишається у getFinances.
// ДІАГНОСТИКА (не використовується кабінетом). Віддає СИРІ рядки регістру по
// всіх вимірах (Организация, Услуга, МесяцНачисления) без підсумовування —
// щоб побачити, на якій саме комбінації лежать суми і звідки береться сальдо.
// Виклик: GET /hs/cabinet/rawbalance?CODE=<GUID ЛС>
Функция getRawBalance(CODE) Экспорт
	Если НЕ ЗначениеЗаполнено(CODE) Тогда
		ТЗ = Новый ТаблицаЗначений; ТЗ.Колонки.Добавить("ERROR");
		ТЗ.Добавить().ERROR = "потрібен параметр CODE (GUID особового рахунку)";
		Возврат ТЗ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Период КАК PERIOD,
	|	ПРЕДСТАВЛЕНИЕ(Т.Организация) КАК ORG,
	|	ПРЕДСТАВЛЕНИЕ(Т.Услуга) КАК SERVICE,
	|	Т.МесяцНачисления КАК ACCRUAL_MONTH,
	|	Т.СуммаНачальныйОстаток КАК CALC_START,
	|	Т.СуммаПриход КАК CALC_ACCRUAL,
	|	Т.СуммаРасход КАК CALC_PAYMENT,
	|	Т.СуммаКонечныйОстаток КАК CALC_FINISH
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Месяц, , ЛицевойСчет = &ЛицевойСчет) КАК Т
	|УПОРЯДОЧИТЬ ПО
	|	PERIOD, SERVICE";
	Результат = Запрос.Выполнить().Выгрузить();
	// Дати -> рядки (в окремі колонки, бо в колонку типу Дата рядок не запишеш),
	// щоб значення коректно лягли в JSON.
	Результат.Колонки.Добавить("PERIOD_TXT");
	Результат.Колонки.Добавить("ACCRUAL_MONTH_TXT");
	Для каждого Строка Из Результат Цикл
		Строка.PERIOD_TXT = Формат(Строка.PERIOD, "ДФ=yyyy-MM-dd");
		Строка.ACCRUAL_MONTH_TXT = ?(ЗначениеЗаполнено(Строка.ACCRUAL_MONTH),
			Формат(Строка.ACCRUAL_MONTH, "ДФ=yyyy-MM-dd"), "");
	КонецЦикла;
	Результат.Колонки.Удалить("PERIOD");
	Результат.Колонки.Удалить("ACCRUAL_MONTH");
	Результат.Колонки.PERIOD_TXT.Имя = "PERIOD";
	Результат.Колонки.ACCRUAL_MONTH_TXT.Имя = "ACCRUAL_MONTH";
	Возврат Результат;
КонецФункции

Функция getBalances(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = "ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	ГОД(Т.Период) КАК PERIOD_YEAR,
	|	МЕСЯЦ(Т.Период) КАК PERIOD_MONTH,
	|	СУММА(Т.СуммаНачальныйОстаток) КАК CALC_START,
	|	СУММА(Т.СуммаПриход) КАК CALC_ACCRUAL,
	|	0.0 КАК CALC_PENALTY,
	|	СУММА(Т.СуммаРасход) КАК CALC_PAYMENT,
	|	0.0 КАК CALC_SUBSIDY,
	|	0.0 КАК CALC_RECALC,
	|	СУММА(Т.СуммаКонечныйОстаток) КАК CALC_FINISH,
	|	Т.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Месяц, , " + Условие + ") КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЛицевойСчет, ГОД(Т.Период), МЕСЯЦ(Т.Период)
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевойСчет, PERIOD_YEAR, PERIOD_MONTH";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		// Якщо потрібно інвертувати знак (борг має бути додатнім) — розкоментуйте:
		// Строка.CALC_START = -Строка.CALC_START;
		// Строка.CALC_ACCRUAL = -Строка.CALC_ACCRUAL;
		// Строка.CALC_PAYMENT = -Строка.CALC_PAYMENT;
		// Строка.CALC_FINISH = -Строка.CALC_FINISH;
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции

// Нарахування/оплати по КОЖНІЙ послузі за місяць (для вкладки "Квитанція").
// Віддає реальну назву послуги (Услуга.Наименование) — тому будь-яка послуга
// (тепло/ТЕ, вода, водовідведення, абонобслуговування, різниця розподілу тощо)
// з'являється в кабінеті автоматично, без окремого мапінгу.
Функция getFinances(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = "Р.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	ВЫБОР КОГДА Р.Услуга.КраткоеНаименование <> """" ТОГДА Р.Услуга.КраткоеНаименование
	|		ИНАЧЕ Р.Услуга.Наименование КОНЕЦ КАК SERVICE_NAME,
	|	Р.Услуга.ЕдиницаИзмерения.Наименование КАК SERVICE_UNIT,
	|	ГОД(Р.Период) КАК PERIOD_YEAR,
	|	МЕСЯЦ(Р.Период) КАК PERIOD_MONTH,
	|	СУММА(Р.Количество) КАК CALC_VOLUME,
	|	МАКСИМУМ(Р.Тариф) КАК RATE_VALUE,
	|	СУММА(Р.Сумма) КАК CALC_ACCRUAL,
	|	Р.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК Р
	|ГДЕ
	|	" + Условие + "Р.Активность И Р.Сумма <> 0
	|	И ТИПЗНАЧЕНИЯ(Р.Регистратор) В (
	|		ТИП(Документ.НачислениеПоЛС), ТИП(Документ.РазовоеНачислениеУслуг),
	|		ТИП(Документ.РаспределениеДополнительныхНачислений), ТИП(Документ.КорректировкаНачислений),
	|		ТИП(Документ.НачислениеПениПоЛС))
	|	И Р.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Р.Услуга.КраткоеНаименование <> """" ТОГДА Р.Услуга.КраткоеНаименование
	|		ИНАЧЕ Р.Услуга.Наименование КОНЕЦ,
	|	Р.Услуга.ЕдиницаИзмерения.Наименование, ГОД(Р.Период), МЕСЯЦ(Р.Период), Р.ЛицевойСчет";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Возврат Результат;
КонецФункции

Функция getPayments(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = "П.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	ГОД(П.Дата) КАК PERIOD_YEAR,
	|	МЕСЯЦ(П.Дата) КАК PERIOD_MONTH,
	|	П.Номер КАК PAYMENT_CODE,
	|	ЕСТЬNULL(ВЫБОР КОГДА П.ДатаВходящегоДокумента = ДАТАВРЕМЯ(1,1,1) ТОГДА NULL ИНАЧЕ П.ДатаВходящегоДокумента КОНЕЦ, П.Дата) КАК PAYMENT_DATE,
	|	П.СуммаПлатежа КАК PAYMENT_CSUM,
	|	П.БанковскийСчет.Банк.Представление КАК PAYMENT_AGENT,
	|	П.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ОплатаУслугМВК КАК П
	|ГДЕ
	|	" + Условие + "П.Проведен И НЕ П.ЛицевойСчет.ПометкаУдаления";
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьКодЛС(Результат);
	Возврат Результат;
КонецФункции

Функция getMeters(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = " И ОбъектУстановки = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	НЕОПРЕДЕЛЕНО КАК METER_CODE,
	|	ВЫБОР У.ПриборУчета.Услуга.ВидУслуги
	|		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.cold""
	|		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""water.hot""
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК METER_TYPE,
	|	У.ПриборУчета.ЗаводскойНомер КАК METER_SERIAL,
	|	У.ТипПрибора КАК METER_MODEL,
	|	У.МестоРазмещения КАК METER_PLACE,
	|	У.ДатаПоследнейПоверки КАК METER_CONFIRMED,
	|	У.ДатаСледующейПоверки КАК METER_NCONFIRMD,
	|	ВЫБОР У.ПриборУчета.Услуга.ВидУслуги
	|		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.ХолоднаяВода) ТОГДА ""water.cold.consumption""
	|		КОГДА ЗНАЧЕНИЕ(Справочник.ВидыУслуг.Водоотведение) ТОГДА ""water.hot.consumption""
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК INDICATOR_TYPE,
	|	У.ПриборУчета.ЕдиницаИзмерения.Наименование КАК INDICATOR_UNIT,
	|	У.ПриборУчета.Коэффициент КАК INDICATOR_COEFFICIENT,
	|	У.ОбъектУстановки КАК ЛицевойСчет,
	|	У.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, НЕ ПриборУчета.ОбщедомовойСчетчик" + Условие + ") КАК У
	|ГДЕ
	|	У.Действует";
	// Повертаємо всі діючі прилади (вода й тепло). Тип показника вище — лише для
	// води; тепловий приходить без нього, і кабінет показує його read-only.
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.METER_CODE   = Строка(Строка.ПриборУчета.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("ПриборУчета");
	Возврат Результат;
КонецФункции

Функция getIndications(CODE) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(CODE) Тогда
		Условие = "И.ЛицевойСчет = &ЛицевойСчет И ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчетПоGUID(CODE));
	Иначе
		Условие = "";
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ACCOUNT_CODE,
	|	НЕОПРЕДЕЛЕНО КАК INDICATOR_CODE,
	|	НАЧАЛОПЕРИОДА(И.Период, ДЕНЬ) КАК PACKAGE_INDICATED,
	|	МИНИМУМ(И.ПоказаниеПредыдущее) КАК INDICATION_PREV,
	|	МАКСИМУМ(И.Показание) КАК INDICATION_CURR,
	|	МАКСИМУМ(ВЫБОР КОГДА И.НачислениеПоСреднему ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК INDICATION_AVERAGE,
	|	""normal"" КАК PACKAGE_TYPE,
	|	И.ЛицевойСчет КАК ЛицевойСчет,
	|	И.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.ПоказанияПриборовЗаМесяц КАК И
	|ГДЕ
	|	" + Условие + "НЕ И.ПриборУчета.ОбщедомовойСчетчик
	|СГРУППИРОВАТЬ ПО
	|	И.ЛицевойСчет, И.ПриборУчета, НАЧАЛОПЕРИОДА(И.Период, ДЕНЬ)";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Строка Из Результат Цикл
		Строка.ACCOUNT_CODE   = Строка(Строка.ЛицевойСчет.УникальныйИдентификатор());
		Строка.INDICATOR_CODE = Строка(Строка.ПриборУчета.УникальныйИдентификатор());
	КонецЦикла;
	Результат.Колонки.Удалить("ЛицевойСчет");
	Результат.Колонки.Удалить("ПриборУчета");
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Запис

// Приймає JSON-масив показань і пише у РегистрСведений.ПоказанияПриборовУчетаССайта.
Функция putReadings(Данные) Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ACCOUNT_CODE");
	Результат.Колонки.Добавить("STATUS");
	Для каждого Стр Из Данные Цикл
		// Код ЛС дістаємо ДО Попытка й тримаємо в змінній: у гілці Исключение
		// звертатися до Стр.ACCOUNT_CODE не можна — саме це звертання й могло
		// кинути помилку, і тоді обробник виключення падає сам, уже без
		// перехоплення, віддаючи 500 замість переліку статусів.
		КодЛС = ?(ТипЗнч(Стр) = Тип("Структура") И Стр.Свойство("ACCOUNT_CODE"), Строка(Стр.ACCOUNT_CODE), "");
		Попытка
			ЛицевойСчет = ЛицевойСчетПоGUID(Стр.ACCOUNT_CODE);
			ПриборУчета = ПриборУчетаПоGUID(Стр.INDICATOR_CODE);
			Набор = РегистрыСведений.ПоказанияПриборовУчетаССайта.СоздатьНаборЗаписей();
			Набор.Отбор.ЛицевойСчет.Установить(ЛицевойСчет);
			Набор.Отбор.ПриборУчета.Установить(ПриборУчета);
			Набор.Отбор.Период.Установить(ТекущаяДата());
			Запись = Набор.Добавить();
			Запись.ЛицевойСчет         = ЛицевойСчет;
			Запись.ПриборУчета         = ПриборУчета;
			Запись.Значение            = Число(Стр.INDICATION_CURR);
			Запись.ПоказаниеПредыдущее = ?(Стр.Свойство("INDICATION_PREV") И Стр.INDICATION_PREV <> Null, Число(Стр.INDICATION_PREV), 0);
			ТипПоказателя              = ?(Стр.Свойство("INDICATOR_TYPE"), Стр.INDICATOR_TYPE, "");
			Запись.Услуга              = Справочники.Услуги.НайтиПоКоду(?(ТипПоказателя = "water.cold.consumption", "000000048", "000000020"));
			Запись.ВидТарифа           = Перечисления.ВидыТарифов.Общий;
			Запись.Период              = ТекущаяДата();
			// "Активность" НЕ встановлюємо. Регістр ПоказанияПриборовУчетаССайта
			// незалежний (WriteMode = Independent) — поля Активность у нього немає,
			// звертання до нього кидає "Поле объекта не обнаружено". Раніше через
			// це ЖОДНЕ показання з кабінету не записувалося, причому непомітно:
			// помилку ковтав Попытка нижче, і POST повертав 200 OK.
			Набор.Записать();
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ACCOUNT_CODE = КодЛС;
			НоваяСтрока.STATUS = "ok";
		Исключение
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ACCOUNT_CODE = КодЛС;
			НоваяСтрока.STATUS = "error: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОбробникиHTTP

Функция getData(Запрос)
	Сущность = НРег(Запрос.ПараметрыURL.Получить("entity"));
	CODE = Запрос.ПараметрыЗапроса.Получить("CODE");
	Если	  Сущность = "accounts"    Тогда Данные = getAccounts(CODE);
	ИначеЕсли Сущность = "contacts"    Тогда Данные = getContacts(CODE);
	ИначеЕсли Сущность = "balances"    Тогда Данные = getBalances(CODE);
	ИначеЕсли Сущность = "finances"    Тогда Данные = getFinances(CODE);
	ИначеЕсли Сущность = "payments"    Тогда Данные = getPayments(CODE);
	ИначеЕсли Сущность = "meters"      Тогда Данные = getMeters(CODE);
	ИначеЕсли Сущность = "indications" Тогда Данные = getIndications(CODE);
	ИначеЕсли Сущность = "rawbalance"  Тогда Данные = getRawBalance(CODE);
	ИначеЕсли Сущность = "state"       Тогда
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("STATE"); ТЗ.Колонки.Добавить("VERSION");
		Стр = ТЗ.Добавить(); Стр.STATE = "ready"; Стр.VERSION = ВерсияСервиса();
		Данные = ТЗ;
	Иначе
		Возврат Новый HTTPСервисОтвет(404);
	КонецЕсли;
	Возврат JSONОтвет(Данные);
КонецФункции

Функция postData(Запрос)
	Сущность = НРег(Запрос.ПараметрыURL.Получить("entity"));
	Если Сущность <> "readings" Тогда
		Возврат Новый HTTPСервисОтвет(404);
	КонецЕсли;
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
	Данные = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	// Очікуємо саме масив. Якщо надійде об'єкт, ПрочитатьJSON поверне Структуру,
	// і обхід у putReadings дав би КлючИЗначение замість показань — помилка
	// спливла б аж усередині циклу запису.
	Если ТипЗнч(Данные) <> Тип("Массив") Тогда
		Возврат Новый HTTPСервисОтвет(400);
	КонецЕсли;
	Возврат JSONОтвет(putReadings(Данные));
КонецФункции

#КонецОбласти
